{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report confirming the SidebarNav first menu item label was changed from 'Fan Controller Dashboard' to 'Dashboard' with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose, styling, and key functionality.",
  "frontend/index.css": "Global Tailwind CSS file defining OKLCH-based design tokens for a dark purple/violet theme with success, warning, chart, and sidebar color variants for both light and dark modes.",
  "frontend/index.html": "HTML entry point for the BLDC Fan Dashboard app, mounting the React app at the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing view state and rendering one of six pages (Dashboard, Fans, Energy, Selection, Schedules, Settings) via a switch statement with a typed CurrentView union.",
  "frontend/src/components/fans/FanControlModal.tsx": "Modal dialog for controlling an individual fan's power and speed, with gradient header, status blocks using chart color tokens, and preset speed buttons.",
  "frontend/src/components/fans/FanListTable.tsx": "Table component listing fans with gradient header, colorful speed progress bars, status indicators, and power toggle buttons with hover effects.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Layout wrapper component rendering a sidebar and main content area with a subtle gradient background.",
  "frontend/src/components/nav/SidebarNav.tsx": "Left sidebar navigation component with six menu items—first labeled 'Dashboard'—using typed CurrentView, gradient header, active state styling, and a footer attribution link.",
  "frontend/src/components/schedules/DeleteScheduleDialog.tsx": "Confirmation dialog for deleting a schedule, displaying fan and time details with destructive styling using shadcn/ui AlertDialog.",
  "frontend/src/components/schedules/ScheduleFormModal.tsx": "A modal form component for creating or editing fan schedules, allowing users to select a fan, set a time, choose days of the week, and pick an action (power-on, power-off, or set-speed).",
  "frontend/src/components/schedules/SchedulesTable.tsx": "A table component that displays all configured schedules with fan info, time, days, action, and enabled status, plus edit/delete controls and a toggle switch.",
  "frontend/src/data/mockFans.ts": "Defines mock fan data and utility functions for filtering, aggregating, and retrieving fans by ID, room, or status.",
  "frontend/src/data/mockSchedules.ts": "Provides in-memory mock schedule data and CRUD utility functions (get, create, update, delete, toggle) for fan schedules.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing login, logout, and identity persistence via DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "A placeholder file reserved for future React Query hooks for backend integration; currently exports nothing.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports DM Sans and DM Mono fonts, and defines a comprehensive set of CSS custom properties for light and dark themes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/EnergyConsumptionPage.tsx": "Displays energy consumption metrics (current power, daily/monthly kWh, estimated cost) and a per-fan consumption table using mock fan data.",
  "frontend/src/pages/FanControllerDashboardPage.tsx": "Main dashboard page showing key fan metrics (total, active, power) and bulk controls for turning all fans on/off and setting speed via a slider.",
  "frontend/src/pages/FanListPage.tsx": "Fan management page that lists all fans in a table with summary stats, and supports toggling power and updating fan settings via a modal.",
  "frontend/src/pages/FanSelectionPage.tsx": "Provides a filterable fan list with dropdowns for room, status, and power state, displaying matching fans from mock data.",
  "frontend/src/pages/SchedulesPage.tsx": "Schedules management page supporting create, edit, delete, and toggle operations on fan automation schedules using mock data and modal/dialog components.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page with persisted (localStorage) preferences for theme, notifications, refresh interval, temperature/power units, and default view.",
  "frontend/src/types/fan.ts": "Defines the Fan interface (id, name, room, power state, speed, status, consumption, etc.) and a FanControlState interface.",
  "frontend/src/types/schedule.ts": "Defines TypeScript types for fan schedules, including the `ScheduleAction` union type and the `Schedule` interface with fields for timing, days, enabled state, and action.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, custom fonts (DM Sans/Mono), and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state at version 3, recording the existing feature to rename the SidebarNav first menu item from 'Fan Controller Dashboard' to 'Dashboard'."
}